Testing: 
Seeing the below when running tf plan in test cluster. Did a target apply of the oidc and then re-ran plan this removed any changes to add. There was no issues applying with tf v1.2.5 

`Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_identity_provider_config.oidc_associate[0] will be created
  + resource "aws_eks_identity_provider_config" "oidc_associate" {
      + arn          = (known after apply)
      + cluster_name = "cp-2402-1149"
      + id           = (known after apply)
      + status       = (known after apply)
      + tags_all     = {
          + "application"   = "cloud-platform-aws/vpc/eks"
          + "business-unit" = "Platforms"
          + "is-production" = "true"
          + "owner"         = "Cloud Platform: platforms@digital.justice.gov.uk"
          + "source-code"   = "github.com/ministryofjustice/cloud-platform-infrastructure"
        }

      + oidc {
          + client_id                     = "gyKOkQMQo6VZFvuebIdWh6jBftXdI1rt"
          + groups_claim                  = "https://k8s.integration.dsd.io/groups"
          + identity_provider_config_name = "Auth0"
          + issuer_url                    = "https://justice-cloud-platform.eu.auth0.com/"
          + username_claim                = "email"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.`

